# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не 
# настолько просто, насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, 
# если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного 
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. 
# Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в 
# порядке и “Пам парам”, если с ритмом все не в порядке |
# Ввод:
# пара-ра-рам рам-пам-папам па-ра-па-да
# Вывод:
# Парам пам-пам

def count_vowel_in_str(col):
    vowel = 'АЕЁИОУЫЭЮЯ'
    syllables = []
    count = 0
    for j in col:
        for i in vowel:
            for k in j:
                if i == k:
                    count += 1
        syllables.append((count))
        count = 0
    return syllables

def compare_syl(col):
    for i in range(len(col)):
        if col[i] != col[i-1]:
            return False
    return True

verse = 'пара-ра-рам рам-пам-папам па-ра-па-да'
phrases = list(map(lambda x: x.upper(), verse.split()))
syl = count_vowel_in_str(phrases)
if compare_syl(syl): print('Парам пам-пам')
else: print('Пам парам')



